{
    "categorias": [
        {
            "id": 1,
            "texto": "front end",
            "cor": "#6bd1ff"
        },
        {
            "id": 2,
            "texto": "back end",
            "cor": "#00C86F"
        },
        {
            "id": 3,
            "texto": "mobile",
            "cor": "#FFBA05"
        }
    ],
    "videos": [
        {
            "id": 1,
            "titulo": "PARA QUEM ESTÁ COMEÇANDO: principais dúvidas sobre começar na carreira de FRONT-END",
            "categoria": 1,
            "imagem": "https://i.ytimg.com/vi/I6xTDxkjjqk/mqdefault.jpg",
            "video": "https://www.youtube.com/watch?v=I6xTDxkjjqk",
            "descricao": "Se você está começando na CARREIRA DE FRONT-END, esse vídeo é pra você :) Como começar na carreira? Precisa fazer faculdade? Qual é a melhor linguagem de programação? O que incluir no portfólio? Fernanda Degolin, desenvolvedora Front-end na Rede Globo, respondeu todas as DÚVIDAS MAIS FREQUENTES de quem está iniciando nessa área. Além disso, Fê também deu DICAS PRÁTICAS pra que você comece com o pé direito. Vamos lá?"
        },
        {
            "id": 2,
            "titulo": "REACT da plataforma da ALURA com KAROL ATTEKITA",
            "categoria": 1,
            "imagem": "https://i.ytimg.com/vi/COS5sIKstJg/mqdefault.jpg",
            "video": "https://www.youtube.com/watch?v=COS5sIKstJg",
            "descricao": "ESTÁ EM DÚVIDA SE A ALURA VALE A PENA OU NÃO? Nesse vídeo, KAROL ATTEKITA apresentou a plataforma da Alura e destacou os pontos que ela acredita serem fundamentais *para quem quer se capacitar, entrar no mercado de tecnologia e melhorar suas habilidades*. Além disso, Karol também deu dicas práticas para quem está começando a estudar tecnologia e não sabe por onde começar. Esse é o momento perfeito para se planejar e colocar a mão na massa, viu? Espero que aproveite :) Sinta-se à vontade para compartilhar suas perguntas e comentários. Vamos adorar conversar com você!"
        },
        {
            "id": 3,
            "titulo": "Tutorial FRAMER: Como CRIAR um SITE com IA?",
            "categoria": 1,
            "imagem": "https://i.ytimg.com/vi/IXCejzBC21Q/mqdefault.jpg",
            "video": "https://www.youtube.com/watch?v=IXCejzBC21Q",
            "descricao": "Neste vídeo você aprenderá a criar um site integrando ferramentas de IA de forma intuitiva e eficaz,mas também ter insights detalhados sobre a publicação do seu site Framer, garantindo que seu projeto ganhe vida no mundo digital. Além disso, você terá acesso a prompts exclusivos para inspirar sua criatividade ao criar um site com Framer, abrindo portas para inovação e personalização sem limites. Este vídeo é um recurso essencial para entusiastas de design e desenvolvimento, oferecendo um mergulho profundo no potencial da IA no contexto do Framer, capacitando-o a criar e compartilhar seu próprio site de maneira única e impactante."
        },
        {
            "id": 4,
            "titulo": "O que faz uma desenvolvedora Back-end? com Juliana Amoasei",
            "categoria": 2,
            "imagem": "https://i.ytimg.com/vi/fiPfvylj6rk/sddefault.jpg",
            "video": "https://www.youtube.com/watch?v=fiPfvylj6rk",
            "descricao": "Afinal, quem trabalha com Back-end faz o que? Com quais outras áreas da tecnologia essa pessoa acaba se relacionando no dia a dia de trabalho e quais os possíveis caminhos nessa carreira? 🤔 A Juliana Amoasei responde tudo isso pra você no vídeo! Confere aí!"
        },
        {
            "id": 5,
            "titulo": "O que é GraphQL? com Juliana Amoasei",
            "categoria": 2,
            "imagem": "https://i.ytimg.com/vi/trf3ZR_K1nk/sddefault.jpg",
            "video": "https://www.youtube.com/watch?v=trf3ZR_K1nk",
            "descricao": "O que é GraphQL? Como ele funciona? Com alguns exemplos incríveis a Juliana Amoasei explicou como trabalhar com essa linguagem. E você, usa GraphQL? O que acha dessa especificação para tratar dados? Confere o conteúdo e conta pra gente nos comentários a sua opinião 👇"
        },
        {
            "id": 6,
            "titulo": "O que é GraphQL? com Juliana Amoasei",
            "categoria": 2,
            "imagem": "https://i.ytimg.com/vi/2hrIwQWx9w4/sddefault.jpg",
            "video": "https://www.youtube.com/watch?v=2hrIwQWx9w4",
            "descricao": "Recebemos a Juliana Amoasei, uma das nossas instrutoras, para falar sobre as principais bibliotecas e frameworks desse imenso ecossistema do Node.JS. Tem alguma que você usa e recomenda que não foi citada no vídeo? Compartilha com a gente nos comentários ⬇"
        },
        {
            "id": 7,
            "titulo": "Desmistificando Mobile- Por onde eu começo? #01",
            "categoria": 3,
            "imagem": "https://i.ytimg.com/vi/2z6f8VN_Pro/sddefault.jpg",
            "video": "https://www.youtube.com/watch?v=2z6f8VN_Pro",
            "descricao": "A Websérie “Desmistificando o mobile” vêm aí para simplificar com exemplos práticos vários assuntos envolvendo o mundo dos aplicativos de celular e neste primeiro episódio vamos partir, literalmente, do começo, por onde começar a estudar sobre o mundo dos apps? Os instrutores da escola de mobile da Alura nos ajudam com essa tarefa 😉"
        },
        {
            "id": 8,
            "titulo": "Desmistificando mobile- Linguagens e Frameworks #2",
            "categoria": 3,
            "imagem": "https://i.ytimg.com/vi/fmu1LQvZhms/sddefault.jpg",
            "video": "https://www.youtube.com/watch?v=fmu1LQvZhms",
            "descricao": "No segundo episódio da websérie “Desmistificando o mobile” vamos entender um pouco sobre o que é feito após ser inserido no mundo dos apps: conhecer um pouco mais sobre frameworks e linguagens de programação e porque existem diferentes para fazer um aplicativo de celular. Vêm aprender um pouco na companhia do Alex Felipe, da Nathalia Thiel, Giovanna Moeller e do Caio Couto 😉"
        },
        {
            "id": 9,
            "titulo": "Nativos: Android e iOS | Desmistificando Mobile- Ep #3",
            "categoria": 3,
            "imagem": "https://i.ytimg.com/vi/9V48oXZdXgQ/sddefault.jpg",
            "video": "https://www.youtube.com/embed/9V48oXZdXgQ",
            "descricao": "Agora que a Helô já que sabe que existem muitas linguagens de programação em mobile e que ela pode escolher qual se encaixa melhor no seu projeto de “como fazer meu primeiro app” ela vai conversar com Alex Felipe, especialista em Android e com a Giovanna Moeller, dev iOS para entender um pouco do mundo dos nativos para desenvolver aplicativos 🤩"
        }
    ]
}